tap "acciaiodigitale/mint-lang"
tap "cavaliercoder/dmidecode"
tap "graalvm/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "spaceghost/casks"
tap "unisonweb/unison"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Tool to obtain certs from Let's Encrypt and autoenable HTTPS
brew "certbot"
# Configurable talking characters in ASCII art
brew "cowsay"
# Manage compile and link flags for libraries
brew "pkg-config"
# Update dynamic DNS entries
brew "ddclient", restart_service: true
# Emulates the detach feature of screen
brew "dtach"
# Command-line tool to interact with exercism.io
brew "exercism"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Banner-like program prints strings as ASCII art
brew "figlet"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# The GNU Compiler Collection
brew "gcc@4.9"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# DevOps management tool
brew "juju"
# Rainbows and unicorns in your console!
brew "lolcat"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Mac App Store command-line interface
brew "mas"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Modern shell for the GitHub era
brew "nushell"
# Development kit for the Java programming language
brew "openjdk"
# Command-line player for https://pandora.com
brew "pianobar"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Generate ASCII art with terminal, shell, and OS info
brew "screenfetch"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Terminal multiplexer
brew "tmux"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Compression and file packaging/archive utility
brew "zip"
# The Mint Language Executable
brew "acciaiodigitale/mint-lang/mint-lang"
# Dmidecode reports information about your system's hardware.
brew "cavaliercoder/dmidecode/dmidecode"
# The Unison Language and Codebase Manager.
brew "unisonweb/unison/unison-language"
cask "alacritty"
cask "font-hack-nerd-font"
cask "graalvm-ce-java11"
cask "hyper"
cask "iterm2"
cask "kitty"
cask "proxyman"
cask "reaper"
cask "seaglass"
cask "spotify"
cask "transmission"
cask "transmission-remote-gui"
cask "tunnelblick"
cask "vlc"
cask "vscodium"
cask "xpra"
mas "Deliveries", id: 924726344
mas "MindNode", id: 1289197285
brew "watchexec"
