tap "acciaiodigitale/mint-lang"
tap "borgbackup/tap"
tap "buildpacks/tap"
tap "cavaliercoder/dmidecode"
tap "dwarvesf/tap"
tap "eugenmayer/dockersync"
tap "github/gh"
tap "graalvm/tap"
tap "hacker1024/hacker1024"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "kdabir/tap"
tap "popcorn-official/popcorn-desktop", "https://github.com/popcorn-official/popcorn-desktop.git"
tap "puma/puma"
tap "spaceghost/casks"
tap "unisonweb/unison"
# Run your GitHub Actions locally 🚀
brew "act"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Library for command-line editing
brew "readline"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Parser generator
brew "bison"
# GNU database manager
brew "gdbm"
# YAML Parser
brew "libyaml"
# Simple wrapper script for the Borg backup software
brew "borgmatic"
# New way to see and navigate directory trees
brew "broot"
# Portable Foreign Function Interface library
brew "libffi"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Tool to obtain certs from Let's Encrypt and autoenable HTTPS
brew "certbot"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Configurable talking characters in ASCII art
brew "cowsay"
# Manage compile and link flags for libraries
brew "pkg-config"
# Update dynamic DNS entries
brew "ddclient", restart_service: true
# Emulates the detach feature of screen
brew "dtach"
# Command-line interface for Cyberduck (a multi-protocol file transfer tool)
brew "duck"
# Modern replacement for 'ls'
brew "exa"
# Command-line tool to interact with exercism.io
brew "exercism"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Collection of GNU find, xargs, and locate
brew "findutils"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GNU Compiler Collection
brew "gcc@4.9"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Command-line option parsing utility
brew "gnu-getopt"
# C code prettifier
brew "gnu-indent"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Implementation of the Smalltalk language
brew "gnu-smalltalk"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Log analyzer and interactive viewer for the Apache Webserver
brew "goaccess"
# GNU grep, egrep and fgrep
brew "grep"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Ping-like tool for HTTP requests
brew "httping"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Regular expressions library
brew "oniguruma"
# Lightweight and flexible command-line JSON processor
brew "jq"
# DevOps management tool
brew "juju"
# Sophisticated file transfer program
brew "lftp"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Rainbows and unicorns in your console!
brew "lolcat"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Securely transfers data between computers
brew "magic-wormhole"
# Mac App Store command-line interface
brew "mas"
# Remote terminal application
brew "mosh"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim", args: ["HEAD"]
# Diagnose infrastructure problems with metrics, visualizations & alarms
brew "netdata"
# Net top tool grouping bandwidth per process
brew "nethogs"
# Platform built on V8 to build network applications
brew "node"
# Modern shell for the GitHub era
brew "nushell"
# Development kit for the Java programming language
brew "openjdk"
# Terminal multiplexer
brew "tmux"
# Process manager for Procfile-based applications and tmux
brew "overmind"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Command-line player for https://pandora.com
brew "pianobar"
# Copy/paste anything over the network
brew "piknik", restart_service: true
# Modern replacement for ps written by Rust
brew "procs"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Rsync for cloud storage
brew "rclone"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Generate ASCII art with terminal, shell, and OS info
brew "screenfetch"
# Version control system designed to be a better CVS
brew "subversion"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Text interface for Git repositories
brew "tig"
# Virtual Private Network (VPN) tool
brew "tinc"
# Anonymizing overlay network for TCP
brew "tor", restart_service: true
# File synchronization tool for OSX
brew "unison"
# Extract, view, and test RAR archives
brew "unrar"
# Execute commands when watched files change
brew "watchexec"
# Command-line streaming torrent client
brew "webtorrent-cli"
# Extensible IRC client
brew "weechat", args: ["HEAD"]
# Internet file retriever
brew "wget"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Compression and file packaging/archive utility
brew "zip"
# The Mint Language Executable
brew "acciaiodigitale/mint-lang/mint-lang"
# Deduplicating archiver with compression and authenticated encryption
brew "borgbackup/tap/borgbackup-fuse"
# A CLI for building apps using Cloud Native Buildpacks
brew "buildpacks/tap/pack"
# Dmidecode reports information about your system's hardware.
brew "cavaliercoder/dmidecode/dmidecode"
# Outputs current CPU core and package temperatures on macOS
brew "hacker1024/hacker1024/coretemp"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# checks presence of various command line tools and their versions on the path
brew "kdabir/tap/has"
# A tool to manage rack apps in development with puma
brew "puma/puma/puma-dev"
# The Unison Language and Codebase Manager.
brew "unisonweb/unison/unison-language"
cask "alacritty"
cask "alt-tab"
cask "anvil"
cask "background-music"
cask "beardedspice"
cask "blackhole"
cask "cakebrew"
cask "calibre"
cask "caption"
cask "eloston-chromium"
cask "eqmac"
cask "font-anonymice-powerline"
cask "font-fantasque-sans-mono"
cask "font-hack-nerd-font"
cask "font-powerline-symbols"
cask "font-source-code-pro-for-powerline"
cask "fuse"
cask "graalvm-ce-java11"
cask "hyper"
cask "iterm2"
cask "kaleidoscope"
cask "keka"
cask "kindle"
cask "kitty"
cask "mtmr"
cask "openemu"
cask "osxfuse"
cask "owasp-zap"
cask "patchwork"
cask "pennywise"
cask "popcorn-time"
cask "proxyman"
cask "seaglass"
cask "sensei"
cask "sensiblesidebuttons"
cask "spotify"
cask "suspicious-package"
cask "textual"
cask "transmission"
cask "transmission-remote-gui"
cask "tunnelblick"
cask "typora"
cask "vimmotion"
cask "vlc"
cask "vorta"
cask "vscodium"
cask "xpra"

tap "danielbayley/alfred"
cask "alfred-theme"
# App dependency already installed independently.
alfred "alfred-workflow", args: { "skip-cask-deps": true }
