tap "acciaiodigitale/mint-lang"
tap "cavaliercoder/dmidecode"
tap "graalvm/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "popcorn-official/popcorn-desktop", "https://github.com/popcorn-official/popcorn-desktop.git"
tap "spaceghost/casks"
tap "unisonweb/unison"
# Library for command-line editing
brew "readline"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Parser generator
brew "bison"
# New way to see and navigate directory trees
brew "broot"
# GNU database manager
brew "gdbm"
# Portable Foreign Function Interface library
brew "libffi"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Tool to obtain certs from Let's Encrypt and autoenable HTTPS
brew "certbot"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Configurable talking characters in ASCII art
brew "cowsay"
# YAML Parser
brew "libyaml"
# Manage compile and link flags for libraries
brew "pkg-config"
# Update dynamic DNS entries
brew "ddclient", restart_service: true
# Emulates the detach feature of screen
brew "dtach"
# Command-line tool to interact with exercism.io
brew "exercism"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Collection of GNU find, xargs, and locate
brew "findutils"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# The GNU Compiler Collection
brew "gcc@4.9"
# Distributed revision control system
brew "git"
# Command-line option parsing utility
brew "gnu-getopt"
# C code prettifier
brew "gnu-indent"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU grep, egrep and fgrep
brew "grep"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Ping-like tool for HTTP requests
brew "httping"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Regular expressions library
brew "oniguruma"
# Lightweight and flexible command-line JSON processor
brew "jq"
# DevOps management tool
brew "juju"
# Rainbows and unicorns in your console!
brew "lolcat"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Securely transfers data between computers
brew "magic-wormhole"
# Mac App Store command-line interface
brew "mas"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Diagnose infrastructure problems with metrics, visualizations & alarms
brew "netdata"
# Platform built on V8 to build network applications
brew "node"
# Modern shell for the GitHub era
brew "nushell"
# Development kit for the Java programming language
brew "openjdk"
# Terminal multiplexer
brew "tmux"
# Process manager for Procfile-based applications and tmux
brew "overmind"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Command-line player for https://pandora.com
brew "pianobar"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Generate ASCII art with terminal, shell, and OS info
brew "screenfetch"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Text interface for Git repositories
brew "tig"
# Virtual Private Network (VPN) tool
brew "tinc"
# Execute commands when watched files change
brew "watchexec"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Compression and file packaging/archive utility
brew "zip"
# The Mint Language Executable
brew "acciaiodigitale/mint-lang/mint-lang"
# Dmidecode reports information about your system's hardware.
brew "cavaliercoder/dmidecode/dmidecode"
# The Unison Language and Codebase Manager.
brew "unisonweb/unison/unison-language"
cask "alacritty"
cask "alt-tab"
cask "anvil"
cask "background-music"
cask "beardedspice"
cask "blackhole"
cask "cakebrew"
cask "caption"
cask "eloston-chromium"
cask "font-fantasque-sans-mono"
cask "font-hack-nerd-font"
cask "fuse"
cask "graalvm-ce-java11"
cask "hyper"
cask "iterm2"
cask "kaleidoscope"
cask "keka"
cask "kindle"
cask "kitty"
cask "osxfuse"
cask "pennywise"
cask "popcorn-time"
cask "proxyman"
cask "reaper"
cask "seaglass"
cask "sensei"
cask "sensiblesidebuttons"
cask "spotify"
cask "suspicious-package"
cask "transmission"
cask "transmission-remote-gui"
cask "tunnelblick"
cask "typora"
cask "vlc"
cask "vscodium"
cask "xpra"
mas "Apple Configurator 2", id: 1037126344
mas "Core Tunnel", id: 1354318707
mas "Deliveries", id: 924726344
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "MindNode", id: 1289197285
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Plash", id: 1494023538
mas "Playgrounds", id: 1496833156
mas "Server", id: 883878097
mas "Tailscale", id: 1475387142
mas "Ulysses", id: 1225570693
mas "Xcode", id: 497799835
