jethrokuan/z
jorgebucaran/fish-bax
acomagu/fish-async-prompt
danhper/fish-ssh-agent
jorgebucaran/fish-getopts
laughedelic/pisces
jorgebucaran/fish-spark
franciscolourenco/done
